zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_unicommspi.h
/* UNICOMMSPI_CLKSEL Bits */
/* UNICOMMSPI_CLKSEL[LFCLK_SEL] Bits */
#define UNICOMMSPI_CLKSEL_LFCLK_SEL_OFS          (1)                             /* !< LFCLK_SEL Offset */
#define UNICOMMSPI_CLKSEL_LFCLK_SEL_MASK         ((uint32_t)0x00000002U)         /* !< Selects LFCLK as clock source if
                                                                                    enabled */
#define UNICOMMSPI_CLKSEL_LFCLK_SEL_DISABLE      ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMSPI_CLKSEL_LFCLK_SEL_ENABLE       ((uint32_t)0x00000002U)         /* !< Select this clock as a source */
/* UNICOMMSPI_CLKSEL[MFCLK_SEL] Bits */
#define UNICOMMSPI_CLKSEL_MFCLK_SEL_OFS          (2)                             /* !< MFCLK_SEL Offset */
#define UNICOMMSPI_CLKSEL_MFCLK_SEL_MASK         ((uint32_t)0x00000004U)         /* !< Selects MFCLK as clock source if
                                                                                    enabled */
#define UNICOMMSPI_CLKSEL_MFCLK_SEL_DISABLE      ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMSPI_CLKSEL_MFCLK_SEL_ENABLE       ((uint32_t)0x00000004U)         /* !< Select this clock as a source */
/* UNICOMMSPI_CLKSEL[BUSCLK_SEL] Bits */
#define UNICOMMSPI_CLKSEL_BUSCLK_SEL_OFS         (3)                             /* !< BUSCLK_SEL Offset */
#define UNICOMMSPI_CLKSEL_BUSCLK_SEL_MASK        ((uint32_t)0x00000008U)         /* !< Selects buscclk as clock source if
                                                                                    enabled */
#define UNICOMMSPI_CLKSEL_BUSCLK_SEL_DISABLE     ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMSPI_CLKSEL_BUSCLK_SEL_ENABLE      ((uint32_t)0x00000008U)         /* !< Select this clock as a source */
/* UNICOMMSPI_CLKSEL[ASYNC_SYSCLK_SEL] Bits */
#define UNICOMMSPI_CLKSEL_ASYNC_SYSCLK_SEL_OFS   (9)                             /* !< ASYNC_SYSCLK_SEL Offset */
#define UNICOMMSPI_CLKSEL_ASYNC_SYSCLK_SEL_MASK  ((uint32_t)0x00000200U)         /* !< Asynchronous sys clock selected as
                                                                                    source */
#define UNICOMMSPI_CLKSEL_ASYNC_SYSCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMSPI_CLKSEL_ASYNC_SYSCLK_SEL_ENABLE ((uint32_t)0x00000200U)         /* !< Select this clock as a source */
/* UNICOMMSPI_CLKSEL[ASYNC_HFCLK_SEL] Bits */
#define UNICOMMSPI_CLKSEL_ASYNC_HFCLK_SEL_OFS    (10)                            /* !< ASYNC_HFCLK_SEL Offset */
#define UNICOMMSPI_CLKSEL_ASYNC_HFCLK_SEL_MASK   ((uint32_t)0x00000400U)         /* !< Asynchronous HFCLK selected as
                                                                                    source */
#define UNICOMMSPI_CLKSEL_ASYNC_HFCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMSPI_CLKSEL_ASYNC_HFCLK_SEL_ENABLE ((uint32_t)0x00000400U)         /* !< Select this clock as a source */
/* UNICOMMSPI_CLKSEL[ASYNC_PLL_SEL] Bits */
#define UNICOMMSPI_CLKSEL_ASYNC_PLL_SEL_OFS      (11)                            /* !< ASYNC_PLL_SEL Offset */
#define UNICOMMSPI_CLKSEL_ASYNC_PLL_SEL_MASK     ((uint32_t)0x00000800U)         /* !< Asynchronous PLL selected as source */
#define UNICOMMSPI_CLKSEL_ASYNC_PLL_SEL_DISABLE  ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMSPI_CLKSEL_ASYNC_PLL_SEL_ENABLE   ((uint32_t)0x00000800U)         /* !< Select this clock as a source */
/* UNICOMMSPI_CLKSEL[ASYNC_LFCLK_SEL] Bits */
#define UNICOMMSPI_CLKSEL_ASYNC_LFCLK_SEL_OFS    (8)                             /* !< ASYNC_LFCLK_SEL Offset */
#define UNICOMMSPI_CLKSEL_ASYNC_LFCLK_SEL_MASK   ((uint32_t)0x00000100U)         /* !< Asynchronous lfclk selected as
                                                                                    source */
#define UNICOMMSPI_CLKSEL_ASYNC_LFCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMSPI_CLKSEL_ASYNC_LFCLK_SEL_ENABLE ((uint32_t)0x00000100U)         /* !< Select this clock as a source */

/* UNICOMMSPI_PDBGCTL Bits */
/* UNICOMMSPI_PDBGCTL[FREE] Bits */
#define UNICOMMSPI_PDBGCTL_FREE_OFS              (0)                             /* !< FREE Offset */
#define UNICOMMSPI_PDBGCTL_FREE_MASK             ((uint32_t)0x00000001U)         /* !< Free run control */
#define UNICOMMSPI_PDBGCTL_FREE_STOP             ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define UNICOMMSPI_PDBGCTL_FREE_RUN              ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* UNICOMMSPI_PDBGCTL[SOFT] Bits */
#define UNICOMMSPI_PDBGCTL_SOFT_OFS              (1)                             /* !< SOFT Offset */
#define UNICOMMSPI_PDBGCTL_SOFT_MASK             ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define UNICOMMSPI_PDBGCTL_SOFT_DEPRECATED       ((uint32_t)0x00000000U)         /* !< Not supported */
#define UNICOMMSPI_PDBGCTL_SOFT_DELAYED          ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

