zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_unicommspi.h
/* UNICOMMSPI_STAT Bits */
/* UNICOMMSPI_STAT[TXFE] Bits */
#define UNICOMMSPI_STAT_TXFE_OFS                 (5)                             /* !< TXFE Offset */
#define UNICOMMSPI_STAT_TXFE_MASK                ((uint32_t)0x00000020U)         /* !< Transmit FIFO empty. */
#define UNICOMMSPI_STAT_TXFE_NOT_EMPTY           ((uint32_t)0x00000000U)         /* !< Transmit FIFO is not empty. */
#define UNICOMMSPI_STAT_TXFE_EMPTY               ((uint32_t)0x00000020U)         /* !< Transmit FIFO is empty. */
/* UNICOMMSPI_STAT[RXFE] Bits */
#define UNICOMMSPI_STAT_RXFE_OFS                 (2)                             /* !< RXFE Offset */
#define UNICOMMSPI_STAT_RXFE_MASK                ((uint32_t)0x00000004U)         /* !< Receive FIFO empty. */
#define UNICOMMSPI_STAT_RXFE_NOT_EMPTY           ((uint32_t)0x00000000U)         /* !< Receive FIFO is not empty. */
#define UNICOMMSPI_STAT_RXFE_EMPTY               ((uint32_t)0x00000004U)         /* !< Receive FIFO is empty. */
/* UNICOMMSPI_STAT[BUSY] Bits */
#define UNICOMMSPI_STAT_BUSY_OFS                 (8)                             /* !< BUSY Offset */
#define UNICOMMSPI_STAT_BUSY_MASK                ((uint32_t)0x00000100U)         /* !< Busy */
#define UNICOMMSPI_STAT_BUSY_IDLE                ((uint32_t)0x00000000U)         /* !< SPI is in idle mode. */
#define UNICOMMSPI_STAT_BUSY_ACTIVE              ((uint32_t)0x00000100U)         /* !< SPI is currently transmitting
                                                                                    and/or receiving data, or transmit
                                                                                    FIFO is not empty. */
/* UNICOMMSPI_STAT[RXCLR] Bits */
#define UNICOMMSPI_STAT_RXCLR_OFS                (4)                             /* !< RXCLR Offset */
#define UNICOMMSPI_STAT_RXCLR_MASK               ((uint32_t)0x00000010U)         /* !< RX FIFO Clear Status */
#define UNICOMMSPI_STAT_RXCLR_CLEARED            ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define UNICOMMSPI_STAT_RXCLR_SET                ((uint32_t)0x00000010U)         /* !< FIFO clear is complete */
/* UNICOMMSPI_STAT[TXCLR] Bits */
#define UNICOMMSPI_STAT_TXCLR_OFS                (7)                             /* !< TXCLR Offset */
#define UNICOMMSPI_STAT_TXCLR_MASK               ((uint32_t)0x00000080U)         /* !< TX FIFO Clear Status */
#define UNICOMMSPI_STAT_TXCLR_CLEARED            ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define UNICOMMSPI_STAT_TXCLR_SET                ((uint32_t)0x00000080U)         /* !< FIFO clear is complete */
/* UNICOMMSPI_STAT[RXFF] Bits */
#define UNICOMMSPI_STAT_RXFF_OFS                 (3)                             /* !< RXFF Offset */
#define UNICOMMSPI_STAT_RXFF_MASK                ((uint32_t)0x00000008U)         /* !< UART Receive FIFO Full  The meaning
                                                                                    of this bit depends on the state of
                                                                                    the FEN bit in the CTL0 register. */
#define UNICOMMSPI_STAT_RXFF_CLEARED             ((uint32_t)0x00000000U)         /* !< The receiver can receive data. */
#define UNICOMMSPI_STAT_RXFF_SET                 ((uint32_t)0x00000008U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the receive holding register is full.
                                                                                    If the FIFO is enabled (FEN is 1),
                                                                                    the receive FIFO is full. */
/* UNICOMMSPI_STAT[TXFF] Bits */
#define UNICOMMSPI_STAT_TXFF_OFS                 (6)                             /* !< TXFF Offset */
#define UNICOMMSPI_STAT_TXFF_MASK                ((uint32_t)0x00000040U)         /* !< UART Transmit FIFO Full  The
                                                                                    meaning of this bit depends on the
                                                                                    state of the FEN bit in the CTL0
                                                                                    register. */
#define UNICOMMSPI_STAT_TXFF_CLEARED             ((uint32_t)0x00000000U)         /* !< The transmitter is not full. */
#define UNICOMMSPI_STAT_TXFF_SET                 ((uint32_t)0x00000040U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the transmit holding register is
                                                                                    full. If the FIFO is enabled (FEN is
                                                                                    1), the transmit FIFO is full. */
/* UNICOMMSPI_STAT[CDMODE] Bits */
#define UNICOMMSPI_STAT_CDMODE_OFS               (12)                            /* !< CDMODE Offset */
#define UNICOMMSPI_STAT_CDMODE_MASK              ((uint32_t)0x0000F000U)         /* !< Current CDMODE status. This
                                                                                    reflects the current counter counter
                                                                                    value. */
#define UNICOMMSPI_STAT_CDMODE_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMSPI_STAT_CDMODE_DATA              ((uint32_t)0x00000000U)         /* !< Manual mode: Data */
#define UNICOMMSPI_STAT_CDMODE_MAXIMUM           ((uint32_t)0x0000F000U)         /* !< Highest possible value */
#define UNICOMMSPI_STAT_CDMODE_COMMAND           ((uint32_t)0x0000F000U)         /* !< Manual mode: Command */

/* UNICOMMSPI_IFLS Bits */
/* UNICOMMSPI_IFLS[TXIFLSEL] Bits */
#define UNICOMMSPI_IFLS_TXIFLSEL_OFS             (0)                             /* !< TXIFLSEL Offset */
#define UNICOMMSPI_IFLS_TXIFLSEL_MASK            ((uint32_t)0x00000007U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define UNICOMMSPI_IFLS_TXIFLSEL_LVL_3_4         ((uint32_t)0x00000001U)         /* !< TX FIFO <= 3/4 empty */
#define UNICOMMSPI_IFLS_TXIFLSEL_LVL_1_2         ((uint32_t)0x00000002U)         /* !< TX FIFO <= 1/2 empty (default) */
#define UNICOMMSPI_IFLS_TXIFLSEL_LVL_1_4         ((uint32_t)0x00000003U)         /* !< TX FIFO <= 1/4 empty */
#define UNICOMMSPI_IFLS_TXIFLSEL_LVL_NOT_FULL    ((uint32_t)0x00000004U)         /* !< Opposite of full */
#define UNICOMMSPI_IFLS_TXIFLSEL_LVL_EMPTY       ((uint32_t)0x00000005U)         /* !< TX FIFO is empty */
#define UNICOMMSPI_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY ((uint32_t)0x00000006U)         /* !< TX FIFO <= 1 */
#define UNICOMMSPI_IFLS_TXIFLSEL_LVL_ALMOST_FULL ((uint32_t)0x00000007U)         /* !< TX_FIFO >= (MAX_FIFO_LEN -1) */
/* UNICOMMSPI_IFLS[RXIFLSEL] Bits */
#define UNICOMMSPI_IFLS_RXIFLSEL_OFS             (4)                             /* !< RXIFLSEL Offset */
#define UNICOMMSPI_IFLS_RXIFLSEL_MASK            ((uint32_t)0x00000070U)         /* !< FIFO Level Select for generating
                                                                                    events (interrupt/dma).  Note: for
                                                                                    undefined settings the default
                                                                                    configuration is used. */
#define UNICOMMSPI_IFLS_RXIFLSEL_LVL_1_4         ((uint32_t)0x00000010U)         /* !< RX FIFO >= 1/4 full */
#define UNICOMMSPI_IFLS_RXIFLSEL_LVL_1_2         ((uint32_t)0x00000020U)         /* !< RX FIFO >= 1/2 full (default) */
#define UNICOMMSPI_IFLS_RXIFLSEL_LVL_3_4         ((uint32_t)0x00000030U)         /* !< RX FIFO >= 3/4 full */
#define UNICOMMSPI_IFLS_RXIFLSEL_LVL_NOT_EMPTY   ((uint32_t)0x00000040U)         /* !< Opposite of empty */
#define UNICOMMSPI_IFLS_RXIFLSEL_LVL_FULL        ((uint32_t)0x00000050U)         /* !< RX FIFO is full */
#define UNICOMMSPI_IFLS_RXIFLSEL_LVL_ALMOST_FULL ((uint32_t)0x00000060U)         /* !< RX_FIFO >= (MAX_FIFO_LEN -1) */
#define UNICOMMSPI_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY ((uint32_t)0x00000070U)         /* !< RX_FIFO <= 1 */
/* UNICOMMSPI_IFLS[TXCLR] Bits */
#define UNICOMMSPI_IFLS_TXCLR_OFS                (3)                             /* !< TXCLR Offset */
#define UNICOMMSPI_IFLS_TXCLR_MASK               ((uint32_t)0x00000008U)         /* !< TX FIFO CLEAR. Setting this bit
                                                                                    will clear the TX FIFO contents. */
#define UNICOMMSPI_IFLS_TXCLR_DISABLE            ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define UNICOMMSPI_IFLS_TXCLR_ENABLE             ((uint32_t)0x00000008U)         /* !< Enable FIFO Clear */
/* UNICOMMSPI_IFLS[RXCLR] Bits */
#define UNICOMMSPI_IFLS_RXCLR_OFS                (7)                             /* !< RXCLR Offset */
#define UNICOMMSPI_IFLS_RXCLR_MASK               ((uint32_t)0x00000080U)         /* !< RX FIFO CLEAR. Setting this bit
                                                                                    will clear the RX FIFO contents. */
#define UNICOMMSPI_IFLS_RXCLR_DISABLE            ((uint32_t)0x00000000U)         /* !< Disable FIFO clear */
#define UNICOMMSPI_IFLS_RXCLR_ENABLE             ((uint32_t)0x00000080U)         /* !< Enable FIFO Clear */

/* UNICOMMSPI_CLKCTL Bits */
/* UNICOMMSPI_CLKCTL[SCR] Bits */
#define UNICOMMSPI_CLKCTL_SCR_OFS                (0)                             /* !< SCR Offset */
#define UNICOMMSPI_CLKCTL_SCR_MASK               ((uint32_t)0x000003FFU)         /* !< Serial clock divider: This is used
                                                                                    to generate the transmit and receive
                                                                                    bit rate of the SPI. The SPI bit rate
                                                                                    is (SPI's functional clock
                                                                                    frequency)/((SCR+1)*2). SCR is a
                                                                                    value from 0-1023. */
#define UNICOMMSPI_CLKCTL_SCR_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMSPI_CLKCTL_SCR_MAXIMUM            ((uint32_t)0x000003FFU)         /* !< Highest possible value */
/* UNICOMMSPI_CLKCTL[DSAMPLE] Bits */
#define UNICOMMSPI_CLKCTL_DSAMPLE_OFS            (28)                            /* !< DSAMPLE Offset */
#define UNICOMMSPI_CLKCTL_DSAMPLE_MASK           ((uint32_t)0xF0000000U)         /* !< Delayed sampling value.  In
                                                                                    controller mode the data on the input
                                                                                    pin will be delayed sampled by the
                                                                                    defined clock cycles of internal
                                                                                    functional clock hence relaxing the
                                                                                    setup time of input data. This
                                                                                    setting is useful in systems where
                                                                                    the board delays and external
                                                                                    peripheral delays are more than the
                                                                                    input setup time of the controller.
                                                                                    Please refer to the datasheet for
                                                                                    values of controller input setup time
                                                                                    and assess what DSAMPLE value meets
                                                                                    the requirement of the system. Note:
                                                                                    High values of DSAMPLE can cause HOLD
                                                                                    time violations and must be factored
                                                                                    in the calculations. */
#define UNICOMMSPI_CLKCTL_DSAMPLE_MINIMUM        ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMSPI_CLKCTL_DSAMPLE_MAXIMUM        ((uint32_t)0xF0000000U)         /* !< Highest possible value */

/* UNICOMMSPI_TXDATA Bits */
/* UNICOMMSPI_TXDATA[DATA] Bits */
#define UNICOMMSPI_TXDATA_DATA_OFS               (0)                             /* !< DATA Offset */
#define UNICOMMSPI_TXDATA_DATA_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< Transmit Data  When read, last
                                                                                    written value will be returned. If
                                                                                    the last write to this field was a
                                                                                    32-bit write (with PACKEN=1), 32-bits
                                                                                    will be returned and if the last
                                                                                    write was a 16-bit write (PACKEN=0),
                                                                                    those 16-bits will be returned.
                                                                                    When written, one or two FIFO entries
                                                                                    will be written depending on PACKEN
                                                                                    value. Data values are removed from
                                                                                    the transmit FIFO one value at a time
                                                                                    by the transmit logic. It is loaded
                                                                                    into the transmit serial shifter,
                                                                                    then serially shifted out onto the
                                                                                    TXD output pin at the programmed bit
                                                                                    rate.   When a data size of less than
                                                                                    16 bits is selected, the user must
                                                                                    right-justify data written to the
                                                                                    transmit FIFO. The transmit logic
                                                                                    ignores the unused bits. */
#define UNICOMMSPI_TXDATA_DATA_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMSPI_TXDATA_DATA_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

